PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
#include <stdio.h>
#include <inttypes.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "custom_logging.h"
#include "nvs_flash.h"
#include "config_manager.h"
#include "esp32_id_manager.h"
#include "wifi_manager.h"
#include "wifi_captive_portal.h"
#include "mqtt_manager.h"
#include "time_manager.h"
#include "watchdog_manager.h"
#include "relay_manager.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"
#include "config_processor.h"
#include "esp_timer.h"

static const char *TAG = "HDDESP32";

static bool g_system_initialized = false;
static bool g_wifi_connected = false;
static bool g_mqtt_connected = false;
static bool g_watchdog_available = false;
static bool g_relay_manager_initialized = false;
static bool g_need_reregister = false;

static char g_mqtt_temp_topic[128];
static char g_esp32_id_buffer[ESP32_ID_LENGTH + 1];

static char g_pending_relay_configs[5][400];
static int g_pending_config_count = 0;
static bool g_system_ready_for_relays = false;

static SemaphoreHandle_t g_callback_mutex = NULL;
static SemaphoreHandle_t g_global_state_mutex = NULL;

typedef struct {
    char topic[128];
    char data[1024];
    int data_len;
    bool pending;
} deferred_mqtt_message_t;

static QueueHandle_t g_mqtt_message_queue = NULL;

static bool get_wifi_connected(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_wifi_connected;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_wifi_connected(bool connected) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_wifi_connected = connected;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static bool get_mqtt_connected(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_mqtt_connected;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_mqtt_connected(bool connected) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_mqtt_connected = connected;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static bool get_relay_manager_initialized(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_relay_manager_initialized;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_relay_manager_initialized(bool initialized) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_relay_manager_initialized = initialized;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static void print_memory_info_simple(void) {
    size_t free_heap = esp_get_free_heap_size();
    size_t min_heap = esp_get_minimum_free_heap_size();
    
    LOG_I(TAG, "Memory: free=%zu min=%zu", free_heap, min_heap);
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MEMORY);
    }
}

static char* find_json_value(const char *json, const char *key, char *value_buf, size_t buf_size) {
    char search_key[64];
    snprintf(search_key, sizeof(search_key), "\"%s\":", key);
    
    char *start = strstr(json, search_key);
    if (!start) {
        return NULL;
    }
    
    start += strlen(search_key);
    while (*start == ' ' || *start == '\t') start++;
    
    if (*start == '"') {
        start++;
        char *end = strchr(start, '"');
        if (!end) return NULL;
        
        size_t len = end - start;
        if (len >= buf_size) len = buf_size - 1;
        
        memcpy(value_buf, start, len);
        value_buf[len] = '\0';
        return value_buf;
    } else {
        char *end = start;
        while (*end && *end != ',' && *end != '}' && *end != ' ') end++;
        
        size_t len = end - start;
        if (len >= buf_size) len = buf_size - 1;
        
        memcpy(value_buf, start, len);
        value_buf[len] = '\0';
        return value_buf;
    }
}

static bool parse_json_bool(const char *json, const char *key) {
    char value_buf[16];
    char *value = find_json_value(json, key, value_buf, sizeof(value_buf));
    if (!value) return false;
    
    return (strcmp(value, "true") == 0 || strcmp(value, "1") == 0);
}

static void process_pending_relay_configs(void) {
    if (g_pending_config_count == 0 || !get_relay_manager_initialized()) {
        return;
    }
    
    LOG_I(TAG, "Processing %d pending relay configurations", g_pending_config_count);
    
    bool relay_processed[RELAY_MANAGER_MAX_RELAYS] = {false};
    
    for (int i = 0; i < g_pending_config_count; i++) {
        if (g_watchdog_available) {
            watchdog_manager_feed();
        }
        
        char command_val[32], relay_id_val[32];
        
        if (find_json_value(g_pending_relay_configs[i], "command", command_val, sizeof(command_val)) &&
            find_json_value(g_pending_relay_configs[i], "relay_id", relay_id_val, sizeof(relay_id_val)) &&
            strcmp(command_val, "update_config") == 0) {
            
            int relay_num = -1;
            if (sscanf(relay_id_val, "relay_%d", &relay_num) == 1 && 
                relay_num >= 1 && relay_num <= RELAY_MANAGER_MAX_RELAYS) {
                
                int relay_index = relay_num - 1;
                
                if (relay_processed[relay_index]) {
                    LOG_W(TAG, "Relay %s already processed - skipping", relay_id_val);
                    continue;
                }
                
                relay_processed[relay_index] = true;
            }
            
            bool is_active = parse_json_bool(g_pending_relay_configs[i], "is_active");
            esp_err_t ret = relay_manager_set_active(relay_id_val, is_active);
            if (ret == ESP_OK) {
                LOG_I(TAG, "Relay %s %s", relay_id_val, is_active ? "ACTIVATED" : "DEACTIVATED");
                vTaskDelay(pdMS_TO_TICKS(50));
                
                char contact_type_val[16];
                if (find_json_value(g_pending_relay_configs[i], "contact_type", contact_type_val, sizeof(contact_type_val))) {
                    relay_contact_type_t type = (strcmp(contact_type_val, "NC") == 0) ? 
                                              RELAY_CONTACT_NC : RELAY_CONTACT_NO;
                    relay_manager_set_contact_type(relay_id_val, type);
                    LOG_I(TAG, "Relay %s contact type: %s", relay_id_val, contact_type_val);
                }
            } else {
                LOG_E(TAG, "Failed to activate relay %s", relay_id_val);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(50));
    }
    
