PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    g_pending_config_count = 0;
    
    vTaskDelay(pdMS_TO_TICKS(200));
    
    LOG_I(TAG, "Force reconfiguring interrupts after all relay activations");
    esp_err_t force_result = relay_manager_force_reconfigure_interrupts();
    if (force_result != ESP_OK) {
        LOG_W(TAG, "Force reconfiguration failed, but continuing...");
    }
    
    vTaskDelay(pdMS_TO_TICKS(100));
    relay_manager_report_initial_states();
    
    LOG_I(TAG, "Pending configurations processed");
    
    uint32_t total_interrupts = 0;
    relay_manager_get_interrupt_stats(&total_interrupts, NULL, NULL);
    LOG_I(TAG, "Total interrupts received after config: %lu", total_interrupts);
}

static void watchdog_event_callback(const watchdog_event_context_t *context, void *user_data) {
    if (!context) {
        return;
    }
    
    watchdog_health_status_t status = context->status;
    watchdog_check_type_t check_type = context->check_type;
    
    const char* status_str = "UNKNOWN";
    const char* check_str = "UNKNOWN";
    
    switch (status) {
        case WATCHDOG_HEALTH_GOOD: status_str = "GOOD"; break;
        case WATCHDOG_HEALTH_WARNING: status_str = "WARNING"; break;
        case WATCHDOG_HEALTH_CRITICAL: status_str = "CRITICAL"; break;
        case WATCHDOG_HEALTH_ERROR: status_str = "ERROR"; break;
        case WATCHDOG_HEALTH_EMERGENCY: status_str = "EMERGENCY"; break;
    }
    
    switch (check_type) {
        case WATCHDOG_CHECK_MEMORY: check_str = "MEMORY"; break;
        case WATCHDOG_CHECK_WIFI: check_str = "WIFI"; break;
        case WATCHDOG_CHECK_MQTT: check_str = "MQTT"; break;
        case WATCHDOG_CHECK_TASKS: check_str = "TASKS"; break;
        case WATCHDOG_CHECK_SYSTEM: check_str = "SYSTEM"; break;
    }
    
    LOG_W(TAG, "Watchdog event: %s - %s (mem: %lu, feeds: %lu)", 
          check_str, status_str, context->current_memory, context->feed_failures);
    
    if (context->additional_info) {
        LOG_I(TAG, "Additional info: %s", context->additional_info);
    }
    
    if (status == WATCHDOG_HEALTH_CRITICAL || status == WATCHDOG_HEALTH_EMERGENCY) {
        if (get_relay_manager_initialized()) {
            LOG_I(TAG, "Saving relay states before potential system restart");
            relay_manager_save_current_states();
            config_manager_force_commit();
        }
        
        switch (check_type) {
            case WATCHDOG_CHECK_MEMORY:
                LOG_E(TAG, "Critical memory situation detected");
                break;
                
            case WATCHDOG_CHECK_WIFI:
                LOG_E(TAG, "Critical WiFi failure detected");
                if (!wifi_manager_is_connected()) {
                    char ap_ssid[33];
                    esp_err_t ret = wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), "FirePanel");
                    if (ret == ESP_OK) {
                        LOG_I(TAG, "Starting emergency AP mode: %s", ap_ssid);
                        wifi_manager_start_ap_mode(ap_ssid, "firepanel");
                    }
                }
                break;
                
            case WATCHDOG_CHECK_MQTT:
                LOG_E(TAG, "Critical MQTT failure detected");
                if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) == ESP_OK) {
                    mqtt_manager_set_esp32_id(g_esp32_id_buffer);
                    mqtt_manager_connect();
                }
                break;
                
            case WATCHDOG_CHECK_TASKS:
                LOG_E(TAG, "Critical task failure detected");
                break;
                
            case WATCHDOG_CHECK_SYSTEM:
                LOG_E(TAG, "Critical system failure detected");
                break;
        }
    } else if (status == WATCHDOG_HEALTH_WARNING) {
        LOG_W(TAG, "System degradation detected in %s subsystem", check_str);
    }
}

static void relay_state_change_callback(const relay_event_t *event, void *user_data) {
    if (!get_mqtt_connected() || !event) {
        return;
    }

    if (xSemaphoreTake(g_callback_mutex, pdMS_TO_TICKS(50)) != pdTRUE) {
        return;
    }
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_TASKS);
    }
    
    char simple_json[120];
    int len = snprintf(simple_json, sizeof(simple_json),
                      "{"
                      "\"relay\":\"%s\","
                      "\"status\":\"%s\","
                      "\"timestamp\":%lld,"
                      "\"contact_type\":\"%s\","
                      "\"old_status\":\"%s\""
                      "}",
                      event->relay_id,
                      (event->new_state == RELAY_STATE_OK) ? "OK" : "DISC",
                      (long long)event->timestamp,
                      (event->contact_type == RELAY_CONTACT_NC) ? "NC" : "NO",
                      (event->old_state == RELAY_STATE_OK) ? "OK" : "DISC");
    
    if (len > 0 && len < sizeof(simple_json)) {
        char relay_topic[88];
        esp_err_t topic_ret = mqtt_manager_get_panel_topic(relay_topic, sizeof(relay_topic), "relays");
        
        if (topic_ret == ESP_OK) {
            mqtt_manager_publish_json(relay_topic, simple_json, 1, false);
            LOG_I(TAG, "Relay %s state: %s -> %s", 
                  event->relay_id,
                  (event->old_state == RELAY_STATE_OK) ? "OK" : "DISC",
                  (event->new_state == RELAY_STATE_OK) ? "OK" : "DISC");
        }
    }
    
    xSemaphoreGive(g_callback_mutex);
}

static esp_err_t relay_mqtt_command_callback(const char *topic, const char *command_json, void *user_data) {
    LOG_I(TAG, "Processing relay MQTT command from topic: %s", topic);
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
    }
    
    return ESP_OK;
}

static void process_deferred_mqtt_message(const char *topic, const char *data, int data_len) {
    if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) != ESP_OK) {
        LOG_E(TAG, "Could not get ESP32 ID");
        return;
    }
    
    snprintf(g_mqtt_temp_topic, sizeof(g_mqtt_temp_topic), "esp32/notify/%s/deleted", g_esp32_id_buffer);
    
