PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
static void on_wifi_connect_callback(void *user_data) {
    LOG_I(TAG, "WiFi configured via captive portal");
}

static void system_monitor_task(void *pvParameters) {
    LOG_I(TAG, "System monitor task started");
    
    bool task_registered = false;
    int registration_attempts = 0;
    
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    while (!task_registered && registration_attempts < 5) {
        if (g_watchdog_available) {
            esp_err_t wd_ret = watchdog_manager_register_task(NULL, "sys_monitor");
            if (wd_ret == ESP_OK) {
                LOG_I(TAG, "System monitor task registered in watchdog manager");
                task_registered = true;
                break;
            }
        }
        
        registration_attempts++;
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
    
    uint32_t cycle_count = 0;
    bool portal_config_verified = false;
    int64_t connection_stable_start = 0;
    const int64_t VERIFICATION_DELAY_MS = 30000;
    static uint32_t uptime_hours = 0;
    const uint32_t QUARTERLY_RESTART_HOURS = 2160;
    
    while (1) {
        if (task_registered) {
            esp_err_t feed_ret = watchdog_manager_feed();
            if (feed_ret != ESP_OK) {
                LOG_D(TAG, "Watchdog feed failed: %s", esp_err_to_name(feed_ret));
            }
        }
        
        cycle_count++;
        
        deferred_mqtt_message_t msg;
        if (xQueueReceive(g_mqtt_message_queue, &msg, pdMS_TO_TICKS(100)) == pdTRUE) {
            if (task_registered) {
                watchdog_manager_feed();
            }
            
            process_deferred_mqtt_message(msg.topic, msg.data, msg.data_len);
            
            if (task_registered) {
                watchdog_manager_feed();
            }
            
            LOG_I(TAG, "Processed 1 MQTT message from queue");
        }
        
        if (cycle_count % 120 == 0 && get_relay_manager_initialized()) {
            if (task_registered) {
                watchdog_manager_feed();
            }
            relay_manager_check_all_states(false);
            if (task_registered) {
                watchdog_manager_feed();
            }
            relay_manager_verify_all_states();
        }
        
        if (cycle_count % 900 == 0 && get_relay_manager_initialized()) {
            LOG_D(TAG, "Performing scheduled relay system check");
            esp_err_t interrupt_check = relay_manager_verify_and_repair_interrupts();
            if (interrupt_check == ESP_FAIL) {
                LOG_W(TAG, "Relay system check reported issues");
            }
        }
        
        if (time_manager_should_send_network_info() || g_need_reregister) {
            LOG_I(TAG, "Sending network info");
            esp_err_t ret = mqtt_manager_send_network_info();
            if (ret == ESP_OK) {
                time_manager_mark_network_info_sent();
                g_need_reregister = false;
            }
        }
        
        if (cycle_count % 180 == 0) {
            print_memory_info_simple();
        }
        
        if (cycle_count % 1800 == 0) {
            uptime_hours++;
            
            if (uptime_hours >= QUARTERLY_RESTART_HOURS) {
                LOG_I(TAG, "QUARTERLY RESTART: System has run %lu hours", uptime_hours);
                
                if (get_relay_manager_initialized()) {
                    relay_manager_save_current_states();
                    config_manager_force_commit();
                }
                
                vTaskDelay(pdMS_TO_TICKS(3000));
                esp_restart();
            }
        }
        
        bool wifi_connected = wifi_manager_is_connected();
        bool mqtt_connected = mqtt_manager_is_connected();
        bool time_synced = time_manager_is_synchronized();
        
        set_wifi_connected(wifi_connected);
        set_mqtt_connected(mqtt_connected);
        
        if (wifi_connected) {
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            wifi_mode_t mode;
            if (esp_wifi_get_mode(&mode) == ESP_OK && mode == WIFI_MODE_APSTA) {
                if (mqtt_connected && time_synced && !portal_config_verified) {
                    if (connection_stable_start == 0) {
                        connection_stable_start = esp_timer_get_time() / 1000;
                        LOG_I(TAG, "Full connectivity detected, starting verification timer");
                    } else {
                        int64_t elapsed = (esp_timer_get_time() / 1000) - connection_stable_start;
                        if (elapsed >= VERIFICATION_DELAY_MS) {
                            LOG_I(TAG, "Configuration complete - restarting to STA mode");
                            vTaskDelay(pdMS_TO_TICKS(2000));
                            esp_restart();
                        } else {
                            int64_t remaining = (VERIFICATION_DELAY_MS - elapsed) / 1000;
                            if (cycle_count % 12 == 0) {
                                LOG_I(TAG, "Restart in %lld seconds", remaining);
                            }
                        }
                    }
                } else if (!mqtt_connected || !time_synced) {
                    connection_stable_start = 0;
                }
            }
            
            if (!time_manager_is_synchronized()) {
                time_manager_check_sync();
            }
            
            mqtt_manager_loop(100);
            
            if (mqtt_connected) {
                if (g_watchdog_available) {
                    watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                }
                
                if (cycle_count % 36 == 0) {
                    LOG_I(TAG, "System OK - WiFi+MQTT connected");
                }
            } else {
                if (cycle_count % 36 == 0) {
                    LOG_I(TAG, "Retrying MQTT connection");
                    if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) == ESP_OK) {
                        mqtt_manager_set_esp32_id(g_esp32_id_buffer);
                        mqtt_manager_connect();
                    }
                }
            }
        } else {
            connection_stable_start = 0;
            
            if (cycle_count % 10 == 0) {
                LOG_I(TAG, "WiFi disconnected - running recovery cycle");
                wifi_manager_handle_disconnection("FirePanel", "firepanel", 10);
            }
        }
        
        if (g_watchdog_available && cycle_count % 90 == 0) {
            watchdog_health_status_t health = watchdog_manager_check_system_health();
            if (health > WATCHDOG_HEALTH_WARNING) {
                LOG_W(TAG, "System health degraded: %d", health);
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(2000));
    }
}

